app/views/agences/new.html.erb

<%= form_for @agence do |a| %>
    <%= a.collection_select(:groupe_id, Groupe.all, :id, :nom) %>
---
SELECT "groupes".* FROM "groupes"