app/views/agences/show.html.erb


<%= @agence.groupe.nom %>
---
SELECT "groupes".* FROM "groupes" WHERE "groupes"."id" = ? ORDER BY "groupes"."id" ASC LIMIT 1  [["id", 2]]