app/controllers/agences_controller.rb

  def index
    @agences = Agence.all
---
SELECT "agences".* FROM "agences" ORDER BY "agences"."id" DESC

  def show
    @agence = Agence.find(params[:id])
---
SELECT "agences".* FROM "agences" WHERE "agences"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @agence = Agence.find(params[:id])
---
SELECT "agences".* FROM "agences" WHERE "agences"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    # Dans un premier temps, on réactive la donnée concernée
    @agence = Agence.find(params[:id])
    # On déclare une variable qui déclare les rubriques autorisées à passer
    agence_params = params.require(:agence).permit(:raison_sociale, :responsable, :telephone, :progouinon, :created_at, :updated_at,
                                                   :email, :rappelerouinon, :adresse, :cp)
    # On met à jour la référence concernée (@agence.update)en mettant à jour les paramètres concernés
    @agence.update(agence_params)
---
SELECT "agences".* FROM "agences" WHERE "agences"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "agences" SET "rappelouinon" = ?, "rappel" = ?, "updated_at" = ? WHERE "agences"."id" = 7  [["rappelouinon", "0"], ["rappel", Wed, 19 Feb 2014 11:28:00 UTC +00:00], ["updated_at", Wed, 19 Feb 2014 11:28:12 UTC +00:00]]

  def create
    # à la diférence de update, on a pas encore d'id, donc on ne peux pas rappeler laligne par son id
    # On déclare une variable qui déclare les rubriques autorisées à passer
    agence_params = params.require(:agence).permit(:raison_sociale, :responsable, :telephone, :progouinon, :created_at, :updated_at,
                                                   :email, :rappelerouinon, :adresse, :cp)
    # On rajoute la référence concernée (@movie.new)en mettant à jour les paramètres concernés
    @agence = Agence.create(agence_params)
---
INSERT INTO "agences" ("adresse", "cp", "created_at", "email", "groupe_id", "progouinon", "raison_sociale", "rappelouinon", "responsable", "telephone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)