app/controllers/groupes_controller.rb

SELECT "groupes".* FROM "groupes"
---
  def index
    @search = Groupe.search(params[:q])

SELECT "groupes".* FROM "groupes" WHERE "groupes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @groupe = Groupe.find(params[:id])

SELECT "groupes".* FROM "groupes" WHERE "groupes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @groupe = Groupe.find(params[:id])

INSERT INTO "groupes" ("created_at", "nom", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Feb 2014 11:29:26 UTC +00:00], ["nom", "Bati"], ["updated_at", Tue, 18 Feb 2014 11:29:26 UTC +00:00]]
---
  def create
    # à la diférence de update, on a pas encore d'id, donc on ne peux pas rappeler laligne par son id
    # On déclare une variable qui déclare les rubriques autorisées à passer
    groupe_params = params.require(:groupe).permit(:nom, :num_rue, :type_voie, :adresse, :cp, :ville,
                                                   :tel, :fax, :email, :contact_civilite, :contact_prenom,
                                                   :contact_nom, :siret)
    # On rajoute la référence concernée (@movie.new)en mettant à jour les paramètres concernés
    @groupe = Groupe.create(groupe_params)

SELECT "groupes".* FROM "groupes" WHERE "groupes"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "groupes" SET "num_rue" = ?, "type_voie" = ?, "adresse" = ?, "cp" = ?, "ville" = ?, "tel" = ?, "email" = ?, "contact_civilite" = ?, "contact_prenom" = ?, "contact_nom" = ?, "siret" = ?, "updated_at" = ? WHERE "groupes"."id" = 1
---
  def update
    # Dans un premier temps, on réactive la donnée concernée
    @groupe = Groupe.find(params[:id])

   # On déclare une variable qui déclare les rubriques autorisées à passer
    groupe_params = params.require(:groupe).permit(:nom, :num_rue, :type_voie, :adresse, :cp, :ville,
                                                   :tel, :fax, :email, :contact_civilite, :contact_prenom,
                                                   :contact_nom, :siret)
   # On met à jour la référence concernée (@agence.update)en mettant à jour les paramètres concernés
    @groupe.update(groupe_params)