app/controllers/programmes_controller.rb

  def index
    @progs = Programme.all
---
SELECT "programmes".* FROM "programmes"