app/controllers/utilisateurs_controller.rb

  def index
    @utils = Utilisateur.all
---
SELECT "utilisateurs".* FROM "utilisateurs"